app/models/user.rb

  def reset_ression_token!
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "WYv_FoZcmzbs5tJGjev4Ww"], ["updated_at", "2022-04-20 19:48:41.849123"], ["id", 1]]